GT2/URANS/KO_HRN/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

//internalField   uniform 1e-09;
internalField   uniform 0.00015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    top
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    slipsurface
    {
        //type            zeroGradient;
        type            slip;
    }

    bottom
    {
	//To enable wall function low/high RE
        type	        kqRWallFunction;
        value           uniform 1e-12;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
