GT2/URANS/KO_HRN/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;

	minIter 	2;
    }

/*
//crazy slow at the begining
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;
	minIter		 3;
    }
*/

    pFinal
    {
	$p;
        tolerance        1e-6;
	relTol		 0;
	minIter		 1;
    }

    U
    {

        //solver           smoothSolver;
        //smoother         GaussSeidel;
        //tolerance        1e-8;
        //relTol           0.0;
        //nSweeps          1;

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.0;
    }

    UFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	minIter		1;
    }

    "(k|kFinal|Oomega|omegaFinal)"
    {

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
	minIter		3;
    }

}

PIMPLE
{
    //momentumPredictor no;
    momentumPredictor yes;	//Smagorinsky keqn diverges with urf 1 at beggining

    consistent 	yes;

    nOuterCorrectors 1;	//1 - 2 - 20
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;

    //pRefCell        0;
    //pRefValue       0;

    turbOnFinalIterOnly false;

/*
    outerCorrectorResidualControl
    {
        "(U|p)"
        //".*"
        {
            relTol          0.01;	//0.01  - 0.001
            tolerance       0.001;	//0.001 - 0.0001
        }
    }
*/

}

//SIMPLEC

relaxationFactors
{
    fields
    {
        ".*"	0.9;
    }
    equations
    {
        ".*"	0.9;
    }
}

//SIMPLE
/*
relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
	nut		0.7;
    }
}
*/

// ************************************************************************* //
